OpenFOAM-dev/tutorials/incompressibleFluid/porousBlockage/constant/coordinateSystems
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      coordinateSystems;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousBlockage
{
    type    cartesian;
    origin  (0 0 0);
    coordinateRotation
    {
        type    axesRotation;
        e1  (1 0 0);
        e2  (0 1 0);
    }
}


// ************************************************************************* //
